Slight formatting changes to .env.examples & Updated ReadMe
